Librianets/RTL8763BF/SDK/1.1.0/src/ble/profile/server/rcu_dfu_service.c
};

/**
 * @brief dfu process time out timer callback
 *
 * @param p_timer - timer handler
 * @return none
 * @retval void
 */
void dfu_process_timeout_timer_callback(TimerHandle_t p_timer)
{
    /*check dfu time out*/
    if (dfuPara.is_dfu_progressing)
    {
        dfu_timeout_handle();
    }
}

/**
 * @brief dfu process time init
 *
 * @param none
 * @return none
 * @retval void
 */
void dfu_timer_init(void)
{
    /* pair_fail_disconn_timer is used to disconnect for pair failed */
    if (false == os_timer_create(&dfu_time_out_timer, "dfu_time_out_timer",  1, \
                                 DFU_PROC_TIME_OUT, false, dfu_process_timeout_timer_callback))
    {
        APP_PRINT_INFO0("[dfu_timer_init] init dfu_timer_init failed");
    }
}

/**
*  @brief: unlock flash is need when erase or write flash.
*/
DATA_RAM_FUNCTION bool unlock_flash_all(void)
{
    prev_bp_lv = 0;
    DFU_PRINT_TRACE0("**********[Flash Set] Flash unlock ***********");
    if (FLASH_SUCCESS == flash_sw_protect_unlock_by_addr_locked((0x00800000), &prev_bp_lv))
    {
        DFU_PRINT_TRACE1("[Flash Set] Flash unlock address = 0x800000, prev_bp_lv = %d", prev_bp_lv);
        return true;
    }
    return false;
}
/**
*  @brief: lock flash after erase or write flash.
*/
DATA_RAM_FUNCTION void lock_flash(void)
{
    if (prev_bp_lv != 0xfe)
    {
        flash_set_block_protect_locked(prev_bp_lv);
    }
}

/**
*  @brief: get image size accord to the image id.
*/
uint32_t get_temp_ota_bank_size_by_img_id(T_IMG_ID image_id)
{
    uint32_t image_size = 0;

    bool enable_old_ota = !is_ota_support_bank_switch();
    if (enable_old_ota)
    {
#if (PATCH_SUPPORT_OTA_APP_DATA_EXTENSION == 1)
        if (image_id == SecureBoot || image_id == RomPatch || image_id == AppPatch
            || image_id == AppData1 || image_id == AppData2 || image_id == AppData3
            || image_id == AppData4 || image_id == AppData5 || image_id == AppData6)
#else
        if (image_id == SecureBoot || image_id == RomPatch || image_id == AppPatch
            || image_id == AppData1 || image_id == AppData2)
#endif
        {
            image_size = flash_get_bank_size(FLASH_OTA_TMP);
        }
        //others will return 0
    }
    else
    {
        uint32_t ota_bank0_addr = flash_get_bank_addr(FLASH_OTA_BANK_0);
        uint32_t temp_bank_addr;
        if (ota_bank0_addr == get_active_ota_bank_addr())
        {
            temp_bank_addr = flash_get_bank_addr(FLASH_OTA_BANK_1);
        }
        else
        {
            temp_bank_addr = ota_bank0_addr;
        }

        if (image_id == OTA)
        {
            image_size = OTA_HEADER_SIZE;
        }
#if (PATCH_SUPPORT_OTA_APP_DATA_EXTENSION == 1)
        else if (image_id == SecureBoot || image_id == RomPatch || image_id == AppPatch
                 || image_id == AppData1 || image_id == AppData2 || image_id == AppData3
                 || image_id == AppData4 || image_id == AppData5 || image_id == AppData6)
#else
        else if (image_id == SecureBoot || image_id == RomPatch || image_id == AppPatch
                 || image_id == AppData1 || image_id == AppData2)
#endif
        {
            // auth ota temp bank and get address
            // image_authencation will fail after secure boot, so remove it
            if (!check_header_valid(temp_bank_addr, OTA))
            {
                image_size = 0;
            }
            else
            {
                image_size = HAL_READ32((uint32_t) & ((T_OTA_HEADER_FORMAT *)temp_bank_addr)->secure_boot_size,
                                        (image_id - SecureBoot) * 8);

                //attention: if use old ota header generate tool, app data3-6 addr will be default value 0xffffffff
                if (OTA_HEADER_DEFAULT_VALUE == image_size)
                {
                    image_size = 0;
                }
            }
        }
        else //others will return 0
        {
        }
    }

    return image_size;
}

/**
* @brief check ota image size whether exceed flash layout address.
*/
bool check_dfu_update_image_length(uint16_t signature, uint32_t offset, uint32_t length,
                                   void *p_void, uint32_t *ret)
{
    uint32_t temp_bank_size = 0;
    *ret = 0;

    if (p_void == NULL)
    {
        *ret = __LINE__;
        return false;
    }

    //temp_bank_size = flash_ioctl(flash_ioctl_get_temp_bank_size_by_image_id, signature, 0); //if patch support
    temp_bank_size = get_temp_ota_bank_size_by_img_id((T_IMG_ID)signature);

    if (offset == 0)
    {
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        uint32_t total_length = p_header->payload_len + 1024;

        if (total_length > temp_bank_size)
        {
            DFU_PRINT_ERROR2("New Image too large! total_length = %d, temp_bank_size = %d", total_length,
                             temp_bank_size);
            *ret = __LINE__;
            return false;
        }
    }

    if (offset + length > temp_bank_size)
    {
        DFU_PRINT_ERROR3("New Image single packet too large! offset = %d, length = %d, temp_bank_size = %d",
                         offset, length, temp_bank_size);
        *ret = __LINE__;
        return false;
    }

    //check pass
    return true;
}


/**
*   flash suspend support
*/
#if SUPPORT_ERASE_SUSPEND
bool erase_in_progress = false;
bool is_suspend = false;
uint32_t signal;
DATA_RAM_FUNCTION void app_flash_erase_suspend()
{
    if (erase_in_progress && !is_suspend)
    {
        bool ret;
        uint8_t status1, status2;
        uint32_t ctrlr0 = SPIC->ctrlr0;
        uint32_t addr_len = SPIC->addr_length;

        signal = os_lock();

        spic_enable(DISABLE);
        spic_clr_multi_ch();
        spic_set_tx_mode();

        SPIC->addr_length = 0;
        spic_set_dr(DATA_BYTE, 0x75);

        spic_enable(ENABLE);
        spic_wait_busy();
        spic_enable(DISABLE);

        while (1)
        {
            ret = flash_cmd_rx(0x35, 1, &status1);
            ret &= flash_cmd_rx(0x05, 1, &status2);

            DFU_PRINT_INFO3("ret is %x,status1 is %x,status2 is %x", ret, status1, status2);

