Librianets/RTL8763BF/SDK/1.1.0/src/ble/profile/server/rcu_dfu_service.c
            if ((!(status1 & BIT_STATUS_WIP) && (status2 & BIT_STATUS_SUSPEND)) ||
                (!(status1 & BIT_STATUS_WIP) && !(status1 & BIT_STATUS_WEL)))
            {
                DFU_PRINT_INFO0("SUSPEND OK");
                platform_delay_us(1);
                is_suspend = true;
                break;
            }
        }
        //restore ctrl0 and addr_len register
        SPIC->ctrlr0 = ctrlr0;
        SPIC->addr_length = addr_len;
        os_unlock(signal);
    }
}
DATA_RAM_FUNCTION void app_flash_erase_resume()
{
    if (erase_in_progress && is_suspend)
    {
        uint32_t ctrlr0 = SPIC->ctrlr0;
        uint32_t addr_len = SPIC->addr_length;

        signal = os_lock();
        spic_enable(DISABLE);
        spic_clr_multi_ch();
        spic_set_tx_mode();

        SPIC->addr_length = 0;

        spic_set_dr(DATA_BYTE, 0x7A);
        spic_enable(ENABLE);
        spic_wait_busy();
        spic_enable(DISABLE);
        is_suspend = false;
        SPIC->ctrlr0 = ctrlr0;
        SPIC->addr_length = addr_len;
        os_unlock(signal);
        DFU_PRINT_INFO0("RESUME OK");
    }
}

DATA_RAM_FUNCTION bool app_flash_wait_busy(void)
{
    uint8_t status1 = 0, status2 = 0;
    uint32_t ctr = 0;
    bool ret;

    while (ctr++ <= 0x10000)
    {
        signal = os_lock();
        ret = flash_cmd_rx(0x05, 1, &status1);
        ret &= flash_cmd_rx(0x35, 1, &status2);

        DFU_PRINT_INFO3("ret is %x,status1 is %x,status2 is %x", ret, status1, status2);
        if (!ret)
        {
            os_unlock(signal);
            goto wait_busy_fail;
        }

        if (!(status1 & BIT_STATUS_WIP) && !(status2 & BIT_STATUS_SUSPEND))
        {
            erase_in_progress = false;
            os_unlock(signal);
            return true;
        }
        os_unlock(signal);
        DFU_PRINT_INFO1("CNT is %x", ctr);
        os_delay(1);
    }

wait_busy_fail:
    return false;
}

//app_flash_wait_busy()
DATA_RAM_FUNCTION bool app_flash_cmd_tx(uint8_t cmd, uint8_t data_len, uint8_t *data_buf)
{
    bool retval = true;
    DFU_PRINT_INFO0("app_flash_cmd_tx");
    uint32_t ctrlr0 = SPIC->ctrlr0;
    uint32_t addr_len = SPIC->addr_length;

    spic_enable(DISABLE);
    spic_clr_multi_ch();
    spic_set_tx_mode();

    SPIC->addr_length = data_len;

    spic_set_dr(DATA_BYTE, cmd);

    while (data_len--)
    {
        spic_set_dr(DATA_BYTE, *data_buf++);
    }

    spic_enable(ENABLE);

    if (!spic_wait_busy())
    {
        retval = false;
    }

    spic_enable(DISABLE);

    os_unlock(signal);

    if (retval == true && !app_flash_wait_busy())
    {
        retval = false;
    }
    //restore ctrl0 and addr_len register
    SPIC->ctrlr0 = ctrlr0;
    SPIC->addr_length = addr_len;

    return retval;
}
//extern bool allowedDfuEnterDlps;
DATA_RAM_FUNCTION uint32_t flash_erase_sector(uint32_t addr)
{

    static uint8_t address[3];
    DFU_PRINT_INFO1("==> flash_erase_sector :%x \r\n", addr);
    address[0] = (addr >> 16) & 0xff;
    address[1] = (addr >> 8) & 0xff;
    address[2] = addr & 0xff;

    //allowedDfuEnterDlps = false;//dlps io driver store/restore in xip
    signal = os_lock();
    erase_in_progress = true;
    app_flash_erase_resume();
    flash_write_enable();
    app_flash_cmd_tx(CMD_SECTOR_ERASE, 3, address);
    //allowedDfuEnterDlps = true;
    //os_unlock(signal);
    return 0;
}
#else
DATA_RAM_FUNCTION bool app_flash_wait_busy(void)
{
    uint8_t status = 0;
    uint32_t ctr = 0;
    bool ret;

    while (ctr++ <= 0x10000)
    {
        ret = flash_cmd_rx(0x05, 1, &status);
        spic_enable(DISABLE);
        DBG_DIRECT("ret is %x,status is %x", ret, status);
        if (!ret)
        {
            goto wait_busy_fail;
        }

        if (!(status & BIT_STATUS_WIP))
        {
            return true;
        }
        DBG_DIRECT("CNT is %x", ctr);
        os_delay(1);
    }

wait_busy_fail:
    return false;
}

//app_flash_wait_busy()
DATA_RAM_FUNCTION bool app_flash_cmd_tx(uint8_t cmd, uint8_t data_len, uint8_t *data_buf)
{
    bool retval = true;
    DBG_DIRECT("app_flash_cmd_tx");
    uint32_t ctrlr0 = SPIC->ctrlr0;
    uint32_t addr_len = SPIC->addr_length;

    spic_enable(DISABLE);
    spic_clr_multi_ch();
    spic_set_tx_mode();

    SPIC->addr_length = data_len;

    spic_set_dr(DATA_BYTE, cmd);

    while (data_len--)
    {
        spic_set_dr(DATA_BYTE, *data_buf++);
    }

    spic_enable(ENABLE);

    if (!spic_wait_busy())
    {
        retval = false;
    }

    spic_enable(DISABLE);
    DBG_DIRECT("spic_wait_busy ..%x", retval);

    if (retval == true && !app_flash_wait_busy())
    {
        retval = false;
    }
    DBG_DIRECT("app_flash_wait_busy ..%x", retval);

    //restore ctrl0 and addr_len register
    SPIC->ctrlr0 = ctrlr0;
    SPIC->addr_length = addr_len;

    return retval;
}

DATA_RAM_FUNCTION uint32_t flash_erase_sector(uint32_t addr)
{

    static uint8_t address[3];
    DFU_PRINT_INFO1("==> flash_erase_sector :%x \r\n", addr);
    address[0] = (addr >> 16) & 0xff;
    address[1] = (addr >> 8) & 0xff;
    address[2] = addr & 0xff;

    flash_lock(FLASH_LOCK_USER_MODE_ERASE);
    flash_write_enable();
    app_flash_cmd_tx(0x20, 3, address);
    flash_unlock(FLASH_LOCK_USER_MODE_ERASE);
    return 0;
}
#endif //#if SUPPORT_ERASE_SUSPEND

/**
*  @brief: write specific image data feceived from host into flash.
*/
DATA_RAM_FUNCTION uint32_t sil_dfu_update(uint16_t signature, uint32_t offset, uint32_t length,
                                          uint32_t/*void*/ *p_void)
{
    uint32_t result = 0;
    uint32_t dfu_base_addr;
    uint32_t start_addr;
    uint32_t s_val;

    DFU_PRINT_INFO1("==> dfu_update length:%d \r\n", length);
    /*ASSERT((length % 4) == 0);*/
    /*ASSERT(p_void);*/

    if (length % 4)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (p_void == 0)
    {
        result = __LINE__;
        goto L_Return;
    }
    /*get back up area address*/
    dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)signature);
    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    /* before erase temp image or write image to flash temp, check access length depend flash layout */
    if (!check_dfu_update_image_length(signature, offset, length, p_void, &result))
    {
        result = __LINE__;
        goto L_Return;
    }

    /*if it's start_packet*/
    if (offset == 0)
    {
        /*ASSERT(length>=sizeof(image_header_t));*/
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        p_header->ctrl_flag.flag_value.not_ready = 0x1; /*make sure image is not ready, will use it later*/
        DFU_PRINT_TRACE3("dfu_update New Image Header:0x%08x, Signature:0x%08x, dfu_base_addr:0x%08x",
                         length, signature, dfu_base_addr);
    }

    if ((offset % FMC_SEC_SECTION_LEN) == 0)   //new page starts
    {
        flash_erase_sector(dfu_base_addr + offset);
    }
    else  // cross page
    {
        if ((offset / FMC_SEC_SECTION_LEN) != ((offset + length) / FMC_SEC_SECTION_LEN))
        {
            flash_erase_sector((dfu_base_addr + offset + length) & ~(FMC_SEC_SECTION_LEN - 1));
        }
    }
    start_addr = dfu_base_addr + offset;
    DFU_PRINT_TRACE1("*p_void:0x%08x", *p_void);
    s_val = flash_auto_read(start_addr | FLASH_OFFSET_TO_NO_CACHE);
    DFU_PRINT_TRACE1("*s_val:0x%08x", s_val);
    for (int i = 0; i < length; i = i + 4)
    {
        flash_auto_write(start_addr + i, *(uint32_t *)p_void);

