Librianets/RTL8763BF/SDK/1.1.0/src/ble/profile/server/rcu_dfu_service.c
    }
}

#if USER_DATA_COPY_EN
/**
*  @brief  copy user data from inactive bank data area to active one.
*/
bool sil_dfu_copy_img(uint16_t signature, uint32_t dlAddress, uint32_t dlSize)
{
    uint32_t error_code = 0;
    uint32_t source_base_addr;
    uint32_t dest_base_addr;
    int remain_size = dlSize;
    uint32_t s_val;
    uint32_t dlOffset, tmp_offset;

    if ((signature != AppData1) && (signature != AppData2))
    {
        error_code = __LINE__;
        goto L_Return;
    }
    if (dlAddress % 0x1000)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    source_base_addr = get_active_ota_bank_addr() & 0xffffff;

    if (flash_get_bank_addr(FLASH_OTA_BANK_0) == get_active_ota_bank_addr())
    {
        dest_base_addr = flash_get_bank_addr(FLASH_OTA_BANK_1) & 0xffffff;
    }
    else
    {
        dest_base_addr = flash_get_bank_addr(FLASH_OTA_BANK_0) & 0xffffff;
    }
    if ((source_base_addr % 4096) || (dest_base_addr % 4096))
    {
        error_code = __LINE__;
        goto L_Return;
    }
    if (dest_base_addr >= dlAddress)
    {
        error_code = __LINE__;
        goto L_Return;
    }
    dlOffset = dlAddress - dest_base_addr;
    tmp_offset = dlOffset;
    if (dlOffset % 4096)
    {
        error_code = __LINE__;
        goto L_Return;
    }
    T_IMG_HEADER_FORMAT *p_data_header;
    p_data_header = (T_IMG_HEADER_FORMAT *)(source_base_addr + dlOffset);
    if (p_data_header->ctrl_header.image_id != signature)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    while (remain_size > 0)
    {
        if (!((dest_base_addr + tmp_offset) % 4096)) //must 4k align
        {
            flash_erase_sector(dest_base_addr + tmp_offset);
        }
        if (remain_size > 2048)
        {
            memcpy(g_pOtaTempBufferHead, (uint8_t *)(source_base_addr + tmp_offset), 2048);
            if (remain_size ==  dlSize)
            {
                T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) g_pOtaTempBufferHead;
                p_header->ctrl_flag.flag_value.not_ready = 0x1; /*make sure image is not ready, will use it later*/
            }
            for (int i = 0; i < 2048; i = i + 4)
            {
                flash_auto_write(dest_base_addr + tmp_offset + i, *(uint32_t *)g_pOtaTempBufferHead);

                s_val = flash_auto_read(dest_base_addr + tmp_offset + i | FLASH_OFFSET_TO_NO_CACHE);
                if (s_val != *(uint32_t *)g_pOtaTempBufferHead)
                {
                    DFU_PRINT_TRACE3("s_val:0x%08x, *p_void:0x%08x, i:0x%08x",
                                     s_val, *(uint32_t *)g_pOtaTempBufferHead, i);
                    error_code = __LINE__;
                    goto L_Return;
                }
                else
                {
                    g_pOtaTempBufferHead += 4;
                }
            }


            remain_size -= 2048;
        }
        else
        {
            memcpy(g_pOtaTempBufferHead, (uint8_t *)(source_base_addr + tmp_offset), remain_size);
            for (int i = 0; i < remain_size; i = i + 4)
            {
                flash_auto_write(dest_base_addr + tmp_offset + i, *(uint32_t *)g_pOtaTempBufferHead);

                s_val = flash_auto_read(dest_base_addr + tmp_offset + i | FLASH_OFFSET_TO_NO_CACHE);
                if (s_val != *(uint32_t *)g_pOtaTempBufferHead)
                {
                    DFU_PRINT_TRACE3("s_val:0x%08x, *p_void:0x%08x, i:0x%08x",
                                     s_val, *(uint32_t *)g_pOtaTempBufferHead, i);
                    error_code = __LINE__;
                    goto L_Return;
                }
                else
                {
                    g_pOtaTempBufferHead += 4;
                }
            }
            remain_size = 0;
        }
        tmp_offset += 2048;
    }

L_Return:
    DFU_PRINT_INFO1("<====dfu_copy_img  error_code:%d", error_code);
    if (error_code)
    {
        return false;
    }
    return true;
}
#endif//#if USER_DATA_COPY_EN
/**
 * @brief silence_BufferCheckProc
 *
 * @param _mBufferSize     size for buffer check.
 * @param _mCrc            calced buffer crc value.
 * @return None
*/
DATA_RAM_FUNCTION void silence_BufferCheckProc(uint16_t _mBufferSize, uint16_t _mCrc)
{
    uint16_t offset = 0;
    uint8_t notif_data[7] = {0};
    notif_data[0] = DFU_OPCODE_NOTIF;
    notif_data[1] = DFU_OPCODE_REPORT_BUFFER_CRC;

    if (mBufSize > DFU_TEMP_BUFFER_SIZE)
    {
        //invalid para
        ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
        LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }
    if (ota_tmp_buf_used_size == mBufSize ||
        dfuPara.nCurOffSet + ota_tmp_buf_used_size == dfuPara.image_total_length
       )
    {
        if (dfu_checkbufcrc(g_pOtaTempBufferHead, ota_tmp_buf_used_size, _mCrc))     //crc error

        {
            ota_tmp_buf_used_size = 0;
            notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
            LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
            server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
            return;
        }

        else //crc ok
        {
            if (OTP->ota_with_encryption_data)
            {
                //aes
                do
                {
                    if ((ota_tmp_buf_used_size - offset) >= 16)
                    {
                        hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
                        hw_aes_decrypt_16byte(g_pOtaTempBufferHead + offset, g_pOtaTempBufferHead + offset);
                        offset += 16;
                    }
                    else
                    {
                        break;
                    }
                }
                while (1);
            }
            unlock_flash_all();
            DFU_PRINT_TRACE1(" p_dfu->cur_offset, %x", dfuPara.nCurOffSet);

            uint32_t result = sil_dfu_update(dfuPara.signature, dfuPara.nCurOffSet, ota_tmp_buf_used_size,
                                             (uint32_t *)g_pOtaTempBufferHead);

            if (result == 0)
            {
                dfuPara.nCurOffSet += ota_tmp_buf_used_size;

                if ((dfuPara.nCurOffSet - gSilDfuResendOffset) >= SECTOR_SIZE)
                {
                    gSilDfuResendOffset += SECTOR_SIZE;
                }
                ota_tmp_buf_used_size = 0;
                notif_data[2] = DFU_ARV_SUCCESS; //valid
                LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                lock_flash();
                return;
            }
            else
            {
                uint32_t ret = 0;
                uint32_t cnt = 0;
                do
                {
                    dfu_flash_erase(dfuPara.signature, gSilDfuResendOffset);
                    //delay_ms_asm(200);
                    ret = dfu_flash_check_blank(dfuPara.signature, gSilDfuResendOffset, SECTOR_SIZE);
                    if (ret)
                    {
                        cnt++;
                    }
                    else
                    {
                        break;
                    }
                    if (cnt >= 3)     //check 0xff failed,erase failed
                    {
                        //erase error
                        ota_tmp_buf_used_size = 0;
                        dfuPara.nCurOffSet =  gSilDfuResendOffset;
                        notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                        LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                         notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                        lock_flash();
                        return;
                    }
                }
                while (1);

                if ((dfuPara.nCurOffSet - gSilDfuResendOffset) > SECTOR_SIZE) //need erase two sector
                {
                    cnt = 0;
                    do
                    {
                        //erase sector :addr ~ gDfuResendOffset+SECTOR_SIZE;
                        dfu_flash_erase(dfuPara.signature, gSilDfuResendOffset + SECTOR_SIZE);
                        ret = dfu_flash_check_blank(dfuPara.signature, gSilDfuResendOffset + SECTOR_SIZE, SECTOR_SIZE);
                        if (ret)
                        {
                            cnt++;
                        }
                        else
                        {
                            break;
                        }
                        if (cnt >= 3)     //check 0xff failed,erase failed
                        {
                            //erase error
                            ota_tmp_buf_used_size = 0;
                            dfuPara.nCurOffSet =  gSilDfuResendOffset;
                            notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                            LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                            server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                             notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                            lock_flash();
                            return;
                        }
                    }
                    while (1);
                }
                //erase ok
                ota_tmp_buf_used_size = 0;
                dfuPara.nCurOffSet =  gSilDfuResendOffset;
                notif_data[2] = DFU_ARV_FAIL_PROG_ERROR;
                LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                lock_flash();
                return;
            }
        }
    }
    else
    {
        DFU_PRINT_TRACE2("ota_temp_buf_used_size is %d,_mBufferSize=%d", ota_tmp_buf_used_size,
                         _mBufferSize);
        //flush buffer.
        ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_LENGTH_ERROR;
        LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }
}


/**
 * @brief silence_dfu_service_handle_packet_req
 *
 * @param length     data reviewed length.
 * @param p_value    data receive point address.
 * @return None
*/
DATA_RAM_FUNCTION void silence_dfu_service_handle_packet_req(uint16_t length, uint8_t *p_value)
{
    DFU_PRINT_TRACE4("dfu_service_handle_packet_req: length=%d, cur_offset =%d, ota_temp_buf_used_size = %d,image_total_length= %d",
                     length,
                     dfuPara.nCurOffSet,
                     ota_tmp_buf_used_size,
                     dfuPara.image_total_length
                    );

